# Gather Section (20 Questions, 40 Marks)

You should have access to a file called TMDB.db. The first step to answering this set of questions will be to connect to this db file to access the data.

![SQL Architectures](https://raw.githubusercontent.com/Explore-AI/Public-Data/master/image/TMDB_ERD.JPG)

Before we start we need to load our SQL magic commands (we only need do this once per notebook):

In [ ]:
import sqlite3

In [ ]:
%reload_ext sql




Based on that data, answer the following questions:


### Question 1
What is the code you can use to connect to the TMDB database that is saved in a Colab notebook?

In [ ]:
# Your code here
%sql sqlite:////content/drive/MyDrive/TMDB.db

In [ ]:
%reload_ext sql
#%sql sqlite:///TMDB.db

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import sqlite3

# إنشاء اتصال بقاعدة بيانات
conn = sqlite3.connect('/content/drive/MyDrive/TMDB.db')

# إنشاء جدول تجريبي
#conn.execute('''
#CREATE TABLE IF NOT EXISTS movies (
 #   id INTEGER PRIMARY KEY,
  #  title TEXT NOT NULL
#);
#''')

# إضافة بيانات
#conn.execute('INSERT INTO movies (title) VALUES ("Inception")')
#conn.commit()

# إغلاق الاتصال
#conn.close()

In [ ]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

### Question 2
What is the primary key for the table “movies”?

In [ ]:
%%sql
PRAGMA table_info(movies);

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[(0, 'movie_id', 'INTEGER', 1, None, 1),
 (1, 'title', 'varchar(500)', 0, 'NULL', 0),
 (2, 'release_date', 'datetime(6)', 0, 'NULL', 0),
 (3, 'budget', 'INTEGER', 0, 'NULL', 0),
 (4, 'homepage', 'varchar(500)', 0, 'NULL', 0),
 (5, 'original_language', 'varchar(50)', 0, 'NULL', 0),
 (6, 'original_title', 'varchar(500)', 0, 'NULL', 0),
 (7, 'overview', 'varchar(5000)', 0, 'NULL', 0),
 (8, 'popularity', 'double', 0, 'NULL', 0),
 (9, 'revenue', 'double', 0, 'NULL', 0),
 (10, 'runtime', 'double', 0, 'NULL', 0),
 (11, 'release_status', 'varchar(50)', 0, 'NULL', 0),
 (12, 'tagline', 'varchar(500)', 0, 'NULL', 0),
 (13, 'vote_average', 'double', 0, 'NULL', 0),
 (14, 'vote_count', 'INTEGER', 0, 'NULL', 0)]

####movie_id is pk

### Question 3
How many foreign keys does the “languagemap” table have?

In [ ]:
%%sql
PRAGMA foreign_key_list(languagemap);

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[(0, 0, 'movies', 'movie_id', 'movie_id', 'NO ACTION', 'NO ACTION', 'NONE'),
 (1, 0, 'languages', 'iso_639_1', 'iso_639_1', 'NO ACTION', 'NO ACTION', 'NONE')]

###2 foreign key

### Question 4
What code would you use to set up a view of all movies that did not get released?

In [ ]:
%%sql
select * from Movies
where release_date is null ;

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[(380097, 'America Is Still the Place', None, 0, None, 'en', 'America Is Still the Place', '"1971 post civil rights San Francisco seemed like the perfect place for a black Korean War veteran and his family to realize their dream of economic  ... (222 characters truncated) ... pened a door that had never been open to a black man before. This is a story about what happened when he stepped through that door, with both feet!."', 0.0, 0.0, 0.0, 'Released', None, 0.0, 0)]

In [ ]:
%%sql
create view non_released as
select *
from movies
where release_date is null ;

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[]

In [ ]:
%%sql
select distinct release_status from movies;

 * sqlite:///TMDB.db
Done.

[('Released',), ('Rumored',), ('Post Production',)]

### Question 5
How would you select only the title, release date, and release status columns from the view you created in the previous question?

In [ ]:
%%sql
select title, release_status
from movies
where release_date is null ;

 * sqlite:///TMDB.db
Done.

[('America Is Still the Place', 'Released')]

In [ ]:
%%sql
select title, release_status
from non_released;

 * sqlite:///TMDB.db
Done.

[('America Is Still the Place', 'Released')]

### Question 6
How many movies are no longer using their original titles?

In [ ]:
%%sql
select count(title)
from movies
where original_title != title;

 * sqlite:///TMDB.db
Done.

[(261,)]

###261

### Question 7
What is the most popular movie that was made after 01/01/2000 with a budget of more than $100 000 000? (Hint: Use the popularity field in the Movies table. Larger numbers are more popular.)

In [ ]:
%%sql
select max(popularity), title
from movies
where release_date >"01/01/2000" and budget > 100000000;

 * sqlite:///TMDB.db
Done.

[(724.247784, 'Interstellar')]

### interstellar is popular movie since 2000 (it is logic)

### Question 8
How many movies are there that do not have English as their original language?

In [ ]:
%%sql
select distinct original_language
from movies

 * sqlite:///TMDB.db
Done.

[('en',),
 ('de',),
 ('es',),
 ('zh',),
 ('ja',),
 ('fr',),
 ('da',),
 ('it',),
 ('sv',),
 ('hi',),
 ('ru',),
 ('pt',),
 ('ko',),
 ('af',),
 ('ro',),
 ('nl',),
 ('ar',),
 ('he',),
 ('th',),
 ('cn',),
 ('tr',),
 ('cs',),
 ('fa',),
 ('no',),
 ('ps',),
 ('vi',),
 ('el',),
 ('hu',),
 ('nb',),
 ('xx',),
 ('id',),
 ('pl',),
 ('is',),
 ('te',),
 ('ta',),
 ('ky',),
 ('sl',)]

In [ ]:
%%sql
select count(title)
from movies
where original_language != "en";

 * sqlite:///TMDB.db
Done.

[(298,)]

###298

### Question 9
In how many movies did Tom Cruise portray the character Ethan Hunt?

In [ ]:
%%sql
select count(title)
from movies
join casts on   movies.movie_id = casts.movie_id
join actors on casts.actor_id = actors.actor_id
where actors.actor_name = 'Tom Cruise'
and casts.characters  like '%Ethan Hunt%';

 * sqlite:///TMDB.db
Done.

[(5,)]

### Question 10
How many times was the actress Cate Blanchett nominated for an Oscar?

In [ ]:
%%sql
select *
from  oscars
limit 7;

 * sqlite:///TMDB.db
Done.

[('1927/1928', 'Actor', None, 'Richard Barthelmess', 'The Noose'),
 ('1927/1928', 'Actor', '1.0', 'Emil Jannings', 'The Last Command'),
 ('1927/1928', 'Actress', None, 'Louise Dresser', 'A Ship Comes In'),
 ('1927/1928', 'Actress', '1.0', 'Janet Gaynor', '7th Heaven'),
 ('1927/1928', 'Actress', None, 'Gloria Swanson', 'Sadie Thompson'),
 ('1927/1928', 'Art Direction', None, 'Rochus Gliese', 'Sunrise'),
 ('1927/1928', 'Art Direction', '1.0', 'William Cameron Menzies', 'The Dove; Tempest')]

In [ ]:
%%sql
select count(name)
from  oscars
where name = 'Cate Blanchett';

 * sqlite:///TMDB.db
Done.

[(7,)]

###7

### Question 11
What would be the code to insert a new genre called ‘Sport’ with an id of 10?

In [ ]:
%%sql
insert into gener (id, name)
values (10, 'Sport');

 * sqlite:///TMDB.db
(sqlite3.OperationalError) no such table: gener
[SQL: insert into gener (id, name)
values (10, 'Sport');]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### Question 12
You have just watched The Flintstones movie and did not find it very funny. What code would delete the entry that links The Flintstones to the Comedy genre?

In [ ]:
%%sql
DELETE FROM genremap WHERE genre_id = 35 AND movie_id = 888;

### Question 13
What code will give me the 10 most recently released movies in the database? and put it in a list

In [ ]:
%%sql
select title, release_date
from movies
order by release_date desc
limit 10;

#sql analysis

### top 5 gennery by popularity

In [ ]:
%%sql
create view  top_genre as
select genre_name, sum(popularity)
from movies
join genremap on movies.movie_id = genremap.movie_id
join genres on genremap.genre_id = genres.genre_id
group by genre_name
order by sum(popularity) desc

limit 5 ;

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[]

In [ ]:
%%sql
select *
from top_genre

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[('Drama', 40805.86819500003),
 ('Action', 35705.201004999966),
 ('Comedy', 31376.56370299994),
 ('Thriller', 31162.137492999955),
 ('Adventure', 31021.75317299999)]

###top 10 films for top 5 genre by popularity

In [ ]:
%%sql
select genre_name, title, popularity
from movies
join genremap on movies.movie_id = genremap.movie_id
join genres on genremap.genre_id = genres.genre_id
where genre_name in (select genre_name from top_genre)
order by popularity desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Adventure', 'Minions', 875.581305),
 ('Comedy', 'Minions', 875.581305),
 ('Adventure', 'Interstellar', 724.247784),
 ('Drama', 'Interstellar', 724.247784),
 ('Adventure', 'Deadpool', 514.569956),
 ('Action', 'Deadpool', 514.569956),
 ('Comedy', 'Deadpool', 514.569956),
 ('Adventure', 'Guardians of the Galaxy', 481.098624),
 ('Action', 'Guardians of the Galaxy', 481.098624),
 ('Adventure', 'Mad Max: Fury Road', 434.278564)]

In [ ]:
%%sql
select genre_name, AVG(revenue)
from movies
join genremap on movies.movie_id = genremap.movie_id
join genres on genremap.genre_id = genres.genre_id
group by genre_name
order by avg(revenue) desc
limit 5;

 * sqlite:///TMDB.db
Done.

[('Animation', 225693025.06410256),
 ('Adventure', 208660204.4949367),
 ('Fantasy', 193354245.1061321),
 ('Family', 162345494.52046785),
 ('Science Fiction', 152456515.41121495)]

### ** In conclsion if you want to gain the highest revenue ,you should make a simple formulae of comedy, family, action ,anime and adventure which is seen clearly in the Minions  film**

## **Interesed pepole Vote **

In [ ]:
%%sql
select genres.genre_name, avg(vote_average)
from movies
join genremap on movies.movie_id = genremap.movie_id
join genres on genremap.genre_id = genres.genre_id
group by genre_name
order by avg(vote_average) desc;

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[('History', 6.71979695431472),
 ('War', 6.713888888888885),
 ('Drama', 6.388593818023497),
 ('Music', 6.355675675675673),
 ('Foreign', 6.35294117647059),
 ('Animation', 6.341452991452991),
 ('Crime', 6.274137931034482),
 ('Documentary', 6.238181818181817),
 ('Romance', 6.207718120805371),
 ('Mystery', 6.183908045977013),
 ('Western', 6.1780487804878055),
 ('Adventure', 6.15696202531646),
 ('Fantasy', 6.09669811320755),
 ('Family', 6.029629629629634),
 ('Thriller', 6.010989010989018),
 ('Science Fiction', 6.005607476635516),
 ('Action', 5.989514731369155),
 ('Comedy', 5.945586527293839),
 ('TV Movie', 5.6625),
 ('Horror', 5.6265895953757274)]

### Top 5 productaion company according to revenue

In [ ]:
%%sql
create view  top_company as
SELECT productioncompanies.production_company_name as company_name, COUNT(movies.title) as count_of_movie,sum(movies.REVENUE) as revenue ,(sum(movies.revenue)-sum(movies.budget)) as Netprofit
FROM movies
JOIN productioncompanymap ON movies.movie_id = productioncompanymap.movie_id
JOIN productioncompanies ON productioncompanymap.production_company_id = productioncompanies.production_company_id
GROUP BY productioncompanies.production_company_name
ORDER BY Netprofit DESC
limit 5 ;

 * sqlite:///TMDB.db
Done.

[]

In [ ]:
%%sql
select *
from top_company

 * sqlite:///TMDB.db
Done.

[('Warner Bros.', 319, 49155747874.0, 30827753925.0),
 ('Universal Pictures', 311, 42588465942.0, 28880599669.0),
 ('Twentieth Century Fox Film Corporation', 222, 39357151309.0, 28529983509.0),
 ('Paramount Pictures', 285, 40878523165.0, 27568910158.0),
 ('Walt Disney Pictures', 114, 28683256048.0, 19099976048.0)]

### **according to this the most  net prorit campany per film is Twentieth Century Fox Film Corporation **

### Top 10 films for top 5 company according to revenue

In [ ]:
%%sql
select productioncompanies.production_company_name  , title, revenue
from movies
JOIN productioncompanymap ON movies.movie_id = productioncompanymap.movie_id
JOIN productioncompanies ON productioncompanymap.production_company_id = productioncompanies.production_company_id
where productioncompanies.production_company_name in (select company_name from top_company)
order by revenue desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Twentieth Century Fox Film Corporation', 'Avatar', 2787965087.0),
 ('Paramount Pictures', 'Titanic', 1845034188.0),
 ('Twentieth Century Fox Film Corporation', 'Titanic', 1845034188.0),
 ('Paramount Pictures', 'The Avengers', 1519557910.0),
 ('Universal Pictures', 'Furious 7', 1506249360.0),
 ('Walt Disney Pictures', 'Frozen', 1274219009.0),
 ('Universal Pictures', 'Minions', 1156730962.0),
 ('Paramount Pictures', 'Transformers: Dark of the Moon', 1123746996.0),
 ('Paramount Pictures', 'Transformers: Age of Extinction', 1091405097.0),
 ('Warner Bros.', 'The Dark Knight Rises', 1084939099.0)]

###top 5 budget

In [ ]:
%%sql
select title ,budget
from movies
order by budget desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Pirates of the Caribbean: On Stranger Tides', 380000000),
 ("Pirates of the Caribbean: At World's End", 300000000),
 ('Avengers: Age of Ultron', 280000000),
 ('Superman Returns', 270000000),
 ('Tangled', 260000000),
 ('John Carter', 260000000),
 ('Spider-Man 3', 258000000),
 ('The Lone Ranger', 255000000),
 ('Harry Potter and the Half-Blood Prince', 250000000),
 ('The Dark Knight Rises', 250000000)]

###Analyze movie budgets and revenues.

In [ ]:
%%sql
select title, budget, revenue ,(revenue-budget) as netprofit
from movies
order by budget desc , revenue desc
limit 10;

 * sqlite:////content/drive/MyDrive/TMDB.db
Done.

[('Pirates of the Caribbean: On Stranger Tides', 380000000, 1045713802.0, 665713802.0),
 ("Pirates of the Caribbean: At World's End", 300000000, 961000000.0, 661000000.0),
 ('Avengers: Age of Ultron', 280000000, 1405403694.0, 1125403694.0),
 ('Superman Returns', 270000000, 391081192.0, 121081192.0),
 ('Tangled', 260000000, 591794936.0, 331794936.0),
 ('John Carter', 260000000, 284139100.0, 24139100.0),
 ('Spider-Man 3', 258000000, 890871626.0, 632871626.0),
 ('The Lone Ranger', 255000000, 89289910.0, -165710090.0),
 ('Captain America: Civil War', 250000000, 1153304495.0, 903304495.0),
 ('The Dark Knight Rises', 250000000, 1084939099.0, 834939099.0)]

*The factor to saw that film is successful is net brofit not revenue or budget as there are alot of films has low budget and high revenue vice versa like the The Lone Ranger has one of 10 high budget films but don't make revenue.

## **Top 10 campany wins oscar**

In [ ]:
%%sql
select film, count (film)
from oscars
group by film
order by count(film) desc
limit 10;

 * sqlite:///TMDB.db
Done.

[('Metro-Goldwyn-Mayer', 60),
 ('Walt Disney, Producer', 57),
 ('Warner Brothers', 42),
 ('John Williams', 42),
 ('France', 36),
 ('Alfred Newman', 34),
 ('Italy', 27),
 ('Paramount', 24),
 ('Gordon Hollingshead, Producer', 22),
 ('Edith Head', 22)]

### Question 14
# Visualization with Python

You can choose **any table** from the database and create visualizations using Python libraries like **Matplotlib** or **Seaborn**. The goal is to explore and understand the data through visual analysis.

For example, you could create a **bar chart** to show the number of movies in each genre or a **scatter plot** to compare movie **budget vs. revenue**.

You can also **combine data from multiple tables** (using SQL joins) to create more complex visualizations. For instance, you might join the **Movies** table with the **Genres** table to show which genres have the highest-rated movies.



### Example Ideas:
- **Genres**: Visualize the most popular genres by the number of movies.
- **Budget vs Revenue**: Analyze the relationship between movie budget and revenue.
- **Languages**: Show the distribution of movies by language using a pie chart.
- **Movie Trends**: Visualize how the number of movie releases has changed over the years.